IdeaRS.OpenModel.Result.ResultOfInternalForces
Result of internal forces in the one position
Remarks: Convention of internal forces on 1D members
Internal forces on 1D members perform following actions:
•	positive bending moment My causes tension in cross-section fibers with negative z-coordinate
•	positive bending moment Mz causes tension in fibers with negative y-coordinate
•	positive torsional moment Mx acts about x-axis of 1D member
•	positive axial force N acts in direction of x-axis of member and causes tension in cross-section fibers
•	positive shear force Qz acts in direction of z-axis of cross-section
•	positive shear force Qy acts in direction of y-axis of cross-section

IdeaRS.OpenModel.Result.ResultOfInternalForces.#ctor
Constructor

IdeaRS.OpenModel.Result.ResultOfInternalForces.N
Normal force

IdeaRS.OpenModel.Result.ResultOfInternalForces.Qy
Shear force in y dirrection

IdeaRS.OpenModel.Result.ResultOfInternalForces.Qz
Shear force in z dirrection

IdeaRS.OpenModel.Result.ResultOfInternalForces.Mx
Bending moment around x-axis

IdeaRS.OpenModel.Result.ResultOfInternalForces.My
Bending moment around y-axis

IdeaRS.OpenModel.Result.ResultOfInternalForces.Mz
Bending moment around z-axis